{"review_id":"xQY8N_XvtGbearJ5X4QryQ","user_id":"OwjRMXRC0KyPrIlcjaXeFQ","business_id":"-MhfebM0QIsKt87iDN-FNw","stars":2.0,"useful":5,"funny":0,"cool":0,"text":"As someone who has worked with many museums, I was eager to visit this gallery on my most recent trip to Las Vegas. When I saw they would be showing infamous eggs of the House of Faberge from the Virginia Museum of Fine Arts (VMFA), I knew I had to go!\n\nTucked away near the gelateria and the garden, the Gallery is pretty much hidden from view. It's what real estate agents would call \"cozy\" or \"charming\" - basically any euphemism for small.\n\nThat being said, you can still see wonderful art at a gallery of any size, so why the two *s you ask? Let me tell you:\n\n* pricing for this, while relatively inexpensive for a Las Vegas attraction, is completely over the top. For the space and the amount of art you can fit in there, it is a bit much.\n* it's not kid friendly at all. Seriously, don't bring them.\n* the security is not trained properly for the show. When the curating and design teams collaborate for exhibitions, there is a definite flow. That means visitors should view the art in a certain sequence, whether it be by historical period or cultural significance (this is how audio guides are usually developed). When I arrived in the gallery I could not tell where to start, and security was certainly not helpful. I was told to \"just look around\" and \"do whatever.\" \n\nAt such a *fine* institution, I find the lack of knowledge and respect for the art appalling.","date":"2015-04-15 05:21:16"}
{"review_id":"UmFMZ8PyXZTY2QcwzsfQYA","user_id":"nIJD_7ZXHq-FX8byPMOkMQ","business_id":"lbrU8StCq3yDfr-QMnGrmQ","stars":1.0,"useful":1,"funny":1,"cool":0,"text":"I am actually horrified this place is still in business. My 3 year old son needed a haircut this past summer and the lure of the $7 kids cut signs got me in the door. We had to wait a few minutes as both stylists were working on people. The decor in this place is total garbage. It is so tacky. The sofa they had at the time was a pleather sofa with giant holes in it. And my son noticed ants crawling all over the floor and the furniture. It was disgusting and I should have walked out then. Actually, I should have turned around and walked out upon entering but I didn't. So the older black male stylist finishes the haircut he was doing and it's our turn. I tell him I want a #2 clipper around the back and sides and then hand cut the top into a standard boys cut. Really freaking simple, right? WRONG! Rather than use the clippers and go up to actually cut the hair, he went down. Using it moving downward doesn't cut hair, it just rubs against it. How does this man who has an alleged cosmetology license not know how to use a set of freaking clippers??? I realized almost immediately that he had no idea what he was doing. No idea at all. After about 10 minutes of watching this guy stumble through it, I said \"you know what? That's fine.\", paid and left. All I wanted to do was get out of that scummy joint and take my son to a real haircut place.\n\nBottom line: DO NOT GO HERE. RUN THE OTHER WAY!!!!!","date":"2013-12-07 03:16:52"}
{"review_id":"LG2ZaYiOgpr2DK_90pYjNw","user_id":"V34qejxNsCbcgD8C0HVk-Q","business_id":"HQl28KMwrEKHqhFrrDqVNQ","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"I love Deagan's. I do. I really do. The atmosphere is cozy and festive. The shrimp tacos and house fries are my standbys. The fries are sometimes good and sometimes great, and the spicy dipping sauce they come with is to die for. The beer list is amazing and the cocktails are great. The prices are mid-level, so it's not a cheap dive you can go to every week, but rather a treat when you do. Try it out. You won't be disappointed!","date":"2015-12-05 03:18:11"}
{"review_id":"i6g_oA9Yf9Y31qt0wibXpw","user_id":"ofKDkJKXSKZXu5xJNGiiBQ","business_id":"5JxlZaqCnk1MnbgRirs40Q","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"Dismal, lukewarm, defrosted-tasting \"TexMex\" glop;\n\nMumbly, unengaged waiter;\n\nClueless manager, who seeing us with barely nibbled entrees\non plates shoved forward for pickup, thanked us\nperfunctorily for our patronage;\n\nWe're from the Texas Hill Country;\ndown there, we jail critters \nwho serve up grub this bad,\nfor their own protection.\n\nNever, never, NEVER again\n(Back to Yard House for real food)","date":"2011-05-27 05:30:52"}
{"review_id":"6TdNDKywdbjoTkizeMce8A","user_id":"UgMW8bLE0QMJDCkQ1Ax5Mg","business_id":"IS4cv902ykd8wj1TR0N3-A","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Oh happy day, finally have a Canes near my casa. Yes just as others are griping about the Drive thru is packed just like most of the other canes in the area but I like to go sit down to enjoy my chicken. The cashiers are pleasant and as far as food wise i have yet to receive any funky chicken. The clean up crew zips around the dining area constantly so it's usually well kept. My only gripe is the one fella with Red hair he makes the rounds while cleaning but no smile or personality a few nights ago he tossed the napkins i just put on the table to help go with my meal. After I was done he just reached for my tray no \"excuse me or are you done with that?\"  I realize he's trying to do his job quickly but a little table manners goes along way. That being said still like to grub here and glad that there's finally a Cane's close to me.","date":"2017-01-14 21:56:57"}
{"review_id":"L2O_INwlrRuoX05KSjc4eg","user_id":"5vD2kmE25YBrbayKhykNxQ","business_id":"nlxHRv1zXGT0c0K51q3jDg","stars":5.0,"useful":2,"funny":0,"cool":0,"text":"This is definitely my favorite fast food sub shop. Ingredients are everything, and everything I see and taste here tells me that they're using top-grade fresh ingredients. The brisket sandwich is probably my favorite... and it's the one my wife ALWAYS gets. Unlike her, I often bounce around the menu to try different things. Definitely a step up from Subway, Quiznos, Jimmy Johns, etc in my opinion. As with all of my reviews, I grade each place relative to what I perceive to be its peers - so five star compared to them.","date":"2013-05-07 07:25:25"}
{"review_id":"ZayJ1zWyWgY9S_TRLT_y9Q","user_id":"aq_ZxGHiri48TUXJlpRkCQ","business_id":"Pthe4qk5xh4n-ef-9bvMSg","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Really good place with simple decor, amazing food and great hospitality.\nVery impressed with the lunch portion. Although service took little extra time but I have no complaints since they are quite new in business. The green curry chicken was good and to the right spice balance I asked for. I will definitely recommend this place to others.","date":"2015-11-05 23:11:05"}
{"review_id":"lpFIJYpsvDxyph-kPzZ6aA","user_id":"dsd-KNYKMpx6ma_sRWCSkQ","business_id":"FNCJpSn0tL9iqoY3JC73qw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Awesome office and staff, very professional and friendly. I saw Adam Garling PA-C and his assistant, they were very friendly, professional, and helpful. I highly recommend Centennial Dermatology! I will definitely return for more visits.","date":"2017-07-18 18:31:54"}
{"review_id":"JA-xnyHytKiOIHl_ztnK9Q","user_id":"P6apihD4ASf1vpPxHODxAQ","business_id":"e_BiI4ej1CW1F0EyVLr-FQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Most delicious authentic Italian I've had in the US. You wouldn't leave this place unhappy. The setting is cozy and a perfect spot for VD, anniversaries, or a special date. They'll make you feel like you're in Italy.","date":"2015-02-16 06:48:47"}
{"review_id":"z4BCgTkfNtCu4XY5Lp97ww","user_id":"jOERvhmK6_lo_XGUBPws_w","business_id":"Ws8V970-mQt2X9CwCuT5zw","stars":4.0,"useful":3,"funny":0,"cool":1,"text":"I have been here twice. Very nice and laid back. I tried the weekend Southern menu and it was delicious! Collard greens, mac&cheese, ribs, BBQ chicken sandwich. The scone with clotted cream was divine!!!! The iced teas are very refreshing and I swear I drank a whole container myself both visits. \nThe second time I had soup, salad and a sandwich. The salad had this amazing (raspberry? strawberry?, I forgot) vinaigrette. The sandwich was good, but I was kind of disappointed with the soup. It was potato and tasted too \"milky\". \nThey change the menu often and now have a tea inspired one. Can't wait to go back and try it.\nThe owners are very nice and I hope they continue to do well.","date":"2009-10-13 04:16:41"}
{"review_id":"TfVth7UNfgilv4J3exPB3A","user_id":"s5j_CRBWDCCMDJ6r7AYqjQ","business_id":"PA61Rwk3AMwOEXHevA7nkg","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Maria is VERY good at what she does with great prices, too! I've always had a hard time finding someone to fix my jeans just right and she did it! I'm short with a small waist and a bit of a butt :) So that means every pair of jean I get have to be altered.  And Maria does a wonderful job with reasonable prices.  She's done more than10 pairs of jeans and a few shirts and only one needed fixing.  I even lost weight and had to get a pair redone, it was a bit of a challenge but she did a beautiful job.","date":"2013-12-28 21:02:55"}
{"review_id":"Tyx7AxYQfSRnBFUIXUJwFA","user_id":"HJECayULRM-6xh2GCCvLiA","business_id":"l-nL4BmhzpZjcavooO48PQ","stars":4.0,"useful":2,"funny":1,"cool":1,"text":"ORDER In (Delivery) Review\n\nI discovered this place from the front desk of the airport hotel and they recommended it highly. I called to place my order for Delivery to my room. They were very accommodating.\n\nWon Ton Soup - nice broth and tender won tons.\n\nChicken with Diced vegetables and Cashews - again, fresh vegetables were used, and good sized pieces of chicken.\n\nCrispy Beef - much like a Ginger Beef, nice serving of Beef with a sweet chilli sauce. Very tasty.\n\nBroccoli in Garlic sauce - came with peppers,Onions , Broccoli was not over done.\n\nAll in all for Delivery , this was really good. I am used to going to Authentic Asian in Vancouver. This hit the spot, and they also sent me a nice tub of Chilli Oil because I like it Hot.","date":"2015-10-17 01:38:13"}
{"review_id":"wJMjt5C2y1RKgY0Xb9jhrA","user_id":"1YIQGP-a534nyksaweEFYA","business_id":"Naa6E0YU0Wr7jCuCE3pYtQ","stars":5.0,"useful":3,"funny":0,"cool":0,"text":"We purchased new office furniture from this location.  We were advised the shipment would arrive in 3 business days.  The shipment was delivered the same day as promised.  We received excellent service from the first step into their showroom at their location on Dean Martin, all thru the delivery.  Very positive experience and great pricing for the quality items we purchased.  Very pleased and will be purchasing more furniture from this store.","date":"2015-07-03 21:48:51"}
{"review_id":"QCxPzh7cuxJrLd6A_UTbpw","user_id":"qftVgPj_kRTildMDjwiqtg","business_id":"Ns4tjgLfqR1qawGlNFROBA","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Everything that my husband and I tried today was amazing. I am glad I got to try something different of what I normally would because i was really pleasantly surprised. We also order one sushi roll because we had to try at least one and we loved it! Definitely will be coming back to try more things. Place is really small, and there was only one server, but we came when it was really slow and the service was pretty fast. All in all very happy we got to try this place out.","date":"2016-06-11 22:00:11"}
{"review_id":"qWHp2l2lysENZObh6MAulA","user_id":"5lb0POg2t-AkMFx6603cYQ","business_id":"ZlCSsWS07JulSBIQlrbF5w","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Called for a 5:15 morning reservation. The driver was here before 5 and didn't alert us, just parked outside quietly. Also he helped out with the luggage and responded to our request of stopping at a differmet place first. Overall 5 star service!","date":"2015-05-26 10:36:47"}
{"review_id":"mjbs5CL4eMu4o6_VtYhN3Q","user_id":"TF4C-F5iqavACQgKTrbjRA","business_id":"7Ka9Pd8X9SRHs1D5EcleLg","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"If I could give less than one star, that would have been my choice.  I rent a home and Per my lease agreement it is MY responsibility to pay their Pool Service company.  Within the last year they changed to PoolServ.  I have had  major issues with new techs every week, never checking PH balances, cleaning the filter, and not showing up at all 2 weeks in the past 2 months. I have had 4 different techs in the past 4 weeks.   I have emailed and called them and they never respond back nor even acknowledged my concerns or requests.  I cannot change companies but I'm required to still pay for lousy or no service.  Attached are a couple pictures of my pool recently due to one tech just didn't put any chlorine in it at all according to the tech who came the following week to attempt to clean it up.  Please think twice before working with these people.  No one wants to work with a business that doesn't return phone calls or emails.","date":"2017-08-07 21:36:36"}
{"review_id":"bVTjZgRNq8ToxzvtiVrqMA","user_id":"2hRe26HSCAWbFRn5WChK-Q","business_id":"d4qwVw4PcN-_2mK2o1Ro1g","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"10pm on a super bowl Sunday and they're already closed?? Weak, no wonder the hard Rock is dying off...","date":"2015-02-02 06:28:00"}
{"review_id":"Ne_2CSfcKIqXHmv_KC0uqg","user_id":"6sJN_HlM_uwpfLJ1puf1Fg","business_id":"oVuZtlCFg_zF090Nhtp0Ow","stars":4.0,"useful":3,"funny":0,"cool":1,"text":"A close friend was in town and so instead of taking him to a more well established joint, we decided to try the newly opened Choolah. We were not disappointed.\n\nI am a bit of an amateur chef myself and consider my palate to be fairly sophisticated when it comes to all kinds of South Asian cuisine. This is not authentic Indian food - we don't have rice and salad bowls - but it is good, wholesome, high quality Indian food.\n\nI ordered a bowl of rice, yellow daal and the koftas (meatballs). The daal was perfect, the way daal should be cooked. The koftas were a little bland for my taste, but otherwise not bad...soft and the right texture. Paired with the many sauces and onions and the whole dish was wholesome and rich and very filling. My friend ordered the biryani, which, while not bad, still isn't the way real biryani should be, and I come from a city known for its biryani - but then I still haven't found a single place in America that makes biryani the way they do it back home.\n\nThe ambiance is good and there's plenty of room to sit. The line moves quickly and at most you'll face a 10-15 min wait on a crowded day. The only issue I had was with the music - being a designer, it bothers me that the music selection to go with such great interiors  could have been better...I would expect Bollywood classics or Indian classical fusion instead of the usual loud pop music.\n\nTldr: if you're looking for authentically prepared and presented Indian food you'll be disappointed. If you're looking for high quality Indian-American food, this is a great place to get it. Will be coming back to try their tikka masala and chicken next.\n\nUpdate: went there again with a bunch of friends and tried their chicken tikka masala and pav bhaji. This is hands down the best Indian place in Pittsburgh - the bhaji is to die for. Make sure you sprinkle lemon on top and have the pav with mango chutney.","date":"2018-02-01 19:15:00"}
{"review_id":"Hy-gUXQh3RVhE8FLH9Dt4Q","user_id":"kMkWON2lmw0s-M-fwiuByg","business_id":"_iGvLfEsqDwPUxRUAe6tUw","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"Tried to have my car repaired.  Even made an appointment.  I was told that all my appointment was for is to meet the service advisor, not get any work completed on my car.  Such a waste of time.  Even talked to the Service Manager, he didn't care.  Since that was the attitude of the service department, I can only expect that from the mechanics that would have worked on my car.  Went to another dealership, made an appointment and my car went in to be repaired.  Not told to come back later and they might get to my car. Very poor service.","date":"2017-06-28 00:39:18"}
{"review_id":"UGErdm6bt48SXTVwJIti2Q","user_id":"QodunSzok4nIYFNrTSGesQ","business_id":"poSV39UqEg-gpESXafS9-g","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"My husband and I go there once a week since last year. We LOVE seafood. Unfortunately, I regretfully say that this place is a hit and miss for us. Some weeks are good, fresh and saucy. Some weeks can be completely opposite. I never thought about writing a review until our experience last week. \nWe ordered medium chicken wings and hot trifecta 2 lbs of shrimp. The wings came out SUPER spicy (probably hot) and the shrimp came out plain ( 99% butter and 1% spices). When we ordered we asked to make sure we have enough sauce but they came in almost dry. My husband and I love this place but we just never know what we will get that night. We just dodge the bullet and hopefully they will be better than last week.","date":"2018-03-04 01:03:53"}
